kk6axq/smartreel/esp32-hmi/src/app/inv_sync.cpp
        // Pick jobs: on demand only.
        if (g_want_jobs) {
            g_want_jobs = false;
            auto* jr = new (std::nothrow) inv_api::PickJobsResult();
            if (jr) {
                inv_api::get_pickjobs(*jr);
                if (jr->status == inv_api::Status::Ok) {
                    SR_LOG("GET /pickjobs OK (%d jobs)", jr->n_jobs);
                    ui::dispatch_on_lvgl(apply_jobs_result, jr);
                } else {
                    SR_LOG("GET /pickjobs FAILED: %s", jr->error);
                    delete jr;
                }
            }
        }
    }
}

} // anonymous namespace

// ---- Public -----------------------------------------------------------

void start() {
    if (g_q_mutex) return;   // already started
    g_q_mutex = xSemaphoreCreateMutex();
    // 8 KB stack: TLS + HTTPClient + the /rack JSON parse. Pinned to
    // APP_CPU at priority 1 (see header).
    xTaskCreatePinnedToCore(worker, "inv-sync", 8 * 1024, nullptr, 1,
                            nullptr, APP_CPU_NUM);
}

void queue_assign(int slot_num, int stock_id) {
    Op op = make_op(OpType::Assign);
    op.slot = slot_num;
    op.stock_id = stock_id;
    SR_LOG("queue assign slot=%d stock=%d", slot_num, stock_id);
    q_push(op);
}

void queue_pick(int slot_num) {
    Op op = make_op(OpType::Pick);
    op.slot = slot_num;
    SR_LOG("queue pick slot=%d", slot_num);
    q_push(op);
}

void queue_job_pick(const char* job_id, int item_idx, int slot_num) {
    Op op = make_op(OpType::JobPick);
    snprintf(op.job_id, sizeof(op.job_id), "%s", job_id ? job_id : "");
    op.item_idx = item_idx;
    op.slot = slot_num;
    SR_LOG("queue job-pick job=%s item=%d slot=%d", op.job_id, item_idx, slot_num);
    q_push(op);
}

void queue_clear(int slot_num, const char* reason) {
    Op op = make_op(OpType::Clear);
    op.slot = slot_num;
    snprintf(op.text, sizeof(op.text), "%s", reason ? reason : "");
    SR_LOG("queue clear slot=%d (%s)", slot_num, op.text);
    q_push(op);
}

void queue_anomaly(const char* kind, int slot_num, const char* detail) {
    Op op = make_op(OpType::Anomaly);
    op.slot = slot_num;
    snprintf(op.kind, sizeof(op.kind), "%s", kind ? kind : "removed");
    snprintf(op.text, sizeof(op.text), "%s", detail ? detail : "");
    SR_LOG("queue anomaly slot=%d kind=%s (%s)", slot_num, op.kind, op.text);
    q_push(op);
}

void request_jobs_refresh(bool force) {
    // Throttled: build_pick_list() requests on every (re)build and the
    // apply path rebuilds the screen, so an unthrottled request would
    // ping-pong fetch->rebuild->fetch forever. 10 s keeps the list
    // live-ish while the user sits on the screen without hammering.
    // A manual Refresh button passes force=true to bypass the throttle.
    static uint32_t last_ms = 0;
    uint32_t now = millis();
    if (!force && last_ms != 0 && (now - last_ms) < 10000) return;
    last_ms = now;
    g_want_jobs = true;
    SR_LOG("jobs refresh requested%s", force ? " (forced)" : "");
}

void request_rack_refresh() { g_want_rack = true; }

bool online() {
    if (!g_online) return false;
    return (millis() - g_last_health_ok) < ONLINE_WINDOW_MS;
}

int pending_ops() {
    if (!g_q_mutex) return 0;
    xSemaphoreTake(g_q_mutex, portMAX_DELAY);
    int n = g_q_count;
    xSemaphoreGive(g_q_mutex);
    return n;
}

} // namespace inv_sync
